namespace Persia.Net.Constants;

public class PersianCalendarConstants
{
    /// <summary>
    /// نام های ماه های تقویم فارسی.
    /// </summary>
    public static readonly string[] Months = ["فروردین", "اردیبهشت", "خرداد", "تیر", "مرداد", "شهریور", "مهر", "آبان", "آذر", "دی", "بهمن", "اسفند"];

    /// <summary>
    /// نام های روزهای ماه به زبان فارسی.
    /// </summary>
    public static readonly string[] Days = ["یکم","دوم","سوم","چهارم","پنجم","ششم","هفتم","هشتم","نهم","دهم","یازدهم","دوازدهم","سیزدهم",
        "چهاردهم","پانزدهم","شانزدهم","هفدهم","هجدهم","نوزدهم","بیستم","بیست و یکم","بیست و دوم",
        "بیست و سوم","بیست و چهارم","بیست و پنجم","بیست و ششم","بیست و هفتم","بیست و هشتم","بیست و نهم","سی ام","سی و یکم"];

    /// <summary>
    /// نام های روزهای هفته به زبان فارسی.
    /// </summary>
    public static readonly string[] Weekdays = ["شنبه", "یکشنبه", "دوشنبه", "سه شنبه", "چهارشنبه", "پنج شنبه", "جمعه"];
}
